app/controllers/todo_items_controller.rb

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", nil], ["updated_at", "2015-04-15 07:54:55.815884"], ["id", 3]]
---
def undo
	@todo_item.update_attribute(:completed_at, nil)