app/controllers/todo_lists_controller.rb

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "12"], ["description", "need to be done"], ["created_at", "2015-04-13 02:23:17.610756"], ["updated_at", "2015-04-13 02:23:17.610756"]]